In [16]:
import pandas as pd

In [17]:
df = pd.DataFrame({'name': ['Persik', 'Brownie'], 'type': ['cat', 'dog'],
                    'color': ['ginger', 'white'], 'height': [17, 30], 
                    'weight': [3.4, 4.3]})
df

      name type   color  height  weight
0   Persik  cat  ginger      17     3.4
1  Brownie  dog   white      30     4.3

In [18]:
df.melt(id_vars= ['name', 'type'], var_name='characteristic', value_name='value_1')

      name type characteristic value_1
0   Persik  cat          color  ginger
1  Brownie  dog          color   white
2   Persik  cat         height      17
3  Brownie  dog         height      30
4   Persik  cat         weight     3.4
5  Brownie  dog         weight     4.3

Преобразуйте представленные данные в длинный формат и запишите в переменную avocado_agg_long. В качестве индекса используйте type

In [19]:
avocado_agg = pd.DataFrame({'type' : ['conventional', 'organic'],
                            'AvgPrice_2015' : [1.077963, 1.673324],
                            'AvgPrice_2016' : [1.105595, 1.571684],
                            'AvgPrice_2017' : [1.294888, 1.735521],
                            'AvgPrice_2018' : [1.127886, 1.567176],
                            })
avocado_agg

           type  AvgPrice_2015  AvgPrice_2016  AvgPrice_2017  AvgPrice_2018
0  conventional       1.077963       1.105595       1.294888       1.127886
1       organic       1.673324       1.571684       1.735521       1.567176

In [20]:
avocado_agg_long = pd.wide_to_long(avocado_agg, stubnames='AvgPrice', 
                j='year', i='type', sep='_')

In [22]:
avocado_agg_long

                   AvgPrice
type         year
conventional 2015  1.077963
organic      2015  1.673324
conventional 2016  1.105595
organic      2016  1.571684
conventional 2017  1.294888
organic      2017  1.735521
conventional 2018  1.127886
organic      2018  1.567176

In [18]:
??pd.wide_to_long